#include <iostream>

using namespace std;
int main()
{
    int n;
    cin >> n;
    bool f = false;
    int a[14] = {4, 7, 44, 47, 74, 77, 444, 447, 474, 477, 744, 747, 774, 777}; //input 1<n<1000 so 1 to  3 digit lucky number list
    for (int i = 0; i < sizeof(a) / sizeof(a[0]); i++)
    {

        if (n % a[i] == 0)
        {
            f = true;
        }
    }
    if (f == true)
    {
        cout << "YES";
    }
    else
    {
        cout << "NO";
    }
}

/*
এই সমস্যাটায় বলা হয়েছে, একটা সংখ্যা n দেওয়া থাকবে (১ থেকে ১০০০ এর মধ্যে)। তোমার কাজ হলো বলা যে এই সংখ্যা “almost lucky” কিনা। এখন “almost lucky” মানে হচ্ছে — সংখ্যাটা যদি এমন কোনো “lucky number” দিয়ে ভাগ যায় যেটা শুধুমাত্র ৪ আর ৭ দিয়ে গঠিত, তাহলে সেটা “almost lucky”।

যেমন, lucky numbers হচ্ছে: 4, 7, 44, 47, 74, 77, 444, 447, 474, 477, 744, 747, 774, 777 — এগুলো সব ৪ আর ৭ দিয়ে গঠিত।

এখন উদাহরণগুলো দেখি:
	1.	ইনপুট: 47 — যেহেতু 47 নিজেই lucky number, এবং 47/47 = 1, তাই আউটপুট হবে YES।
	2.	ইনপুট: 16 — এটা 4 দিয়ে ভাগ যায় (16/4 = 4), এবং 4 একটা lucky number, তাই আউটপুট হবে YES।
	3.	ইনপুট: 78 — এটা lucky number না, আবার lucky কোনো সংখ্যার দ্বারা ভাগও যায় না, তাই আউটপুট হবে NO।

এই সমস্যাটার সমাধান করতে হলে আমাদের শুধু ১ থেকে ১০০০ পর্যন্ত যত lucky number আছে, সেগুলো একটা লিস্টে রাখতে হবে, তারপর চেক করতে হবে n ঐ লিস্টের কোনো সংখ্যায় ভাগ যায় কিনা।

টাইম কমপ্লেক্সিটি: O(k), যেখানে k হলো lucky number-এর সংখ্যা (এখানে প্রায় 20-30 এর মত)। স্পেস কমপ্লেক্সিটি: O(1) যদি প্রি-ডিফাইনড lucky number ইউজ করি।
*/