/*
এই প্রবলেমে বলা হয়েছে, একটা স্কুলে ছেলেমেয়েরা ক্যান্টিনে লাইনে দাঁড়িয়েছে। লাইনের শুরুতে যে দাঁড়ায়, সে আগে খাবার পায়। যদি কোনো এক মুহূর্তে দেখা যায়, একটা ছেলে (B) সামনে আছে আর তার ঠিক পেছনে একটা মেয়ে (G) দাঁড়িয়ে আছে, তাহলে পরের সেকেন্ডে তারা জায়গা বদলে নেবে — অর্থাৎ মেয়ে সামনে চলে আসবে, ছেলে পিছনে যাবে। এইভাবে t সেকেন্ড পর্যন্ত বারবার এই চেঞ্জ হবে।

তোমাকে দেওয়া হবে লাইনের দৈর্ঘ্য n এবং সময় t। এরপর দেওয়া থাকবে n টা চরিত্র নিয়ে গঠিত একটা স্ট্রিং s, যেখানে ‘B’ মানে ছেলে, আর ‘G’ মানে মেয়ে। তোমার কাজ হচ্ছে t সেকেন্ড পর লাইনের অবস্থা কী হবে সেটা বের করা।

ইনপুট:
প্রথম লাইন: দুটি পূর্ণসংখ্যা n এবং t (1 ≤ n, t ≤ 50)
দ্বিতীয় লাইন: দৈর্ঘ্য n এর একটি স্ট্রিং, যেমন: BGGBG

আউটপুট:
একটি স্ট্রিং — t সেকেন্ড পরে লাইনের নতুন অবস্থা।

উদাহরণ ইনপুট ও আউটপুট:

Input:
5 1
BGGBG
Output:
GBGGB

Input:
5 2
BGGBG
Output:
GGBGB

Input:
4 1
GGGB
Output:
GGGB

এই সমস্যার সমাধানে আমরা প্রতিটি সেকেন্ডের জন্য একটা লুপ চালাবো। প্রতিবার t সময়ের জন্য পুরো স্ট্রিংয়ের উপর চেক করব, যদি কোথাও ‘B’ এবং তার পরের চরিত্রে ‘G’ থাকে, তাহলে তাদের অদলবদল করব এবং i=i+1 করে দেব, যেন একই ছেলে আবার একই সেকেন্ডে আরেকটা চেঞ্জ না করে।

এখন ইনপুট সাইজ বিশ্লেষণ করলে, n এবং t দুটোই সর্বোচ্চ ৫০ পর্যন্ত যেতে পারে, তাই সর্বোচ্চ ৫০৫০ = ২৫০০ অপারেশন হবে। এটা খুবই ছোট ইনপুট সাইজ, তাই Time Complexity হচ্ছে O(nt) এবং Space Complexity O(n) কারণ আমরা শুধুমাত্র একটা স্ট্রিং নিয়ে কাজ করছি।

*/
#include <iostream>
#include <queue>
using namespace std;
int main()
{
    int n, t;
    cin >> n >> t;
    char a[n];
       for (int i = 0; i < n; i++)
    {
        cin >>a[i];
    }
    for (int i = 0; i < t; i++)
    {
        for (int i = 0; i < n; i++)
        {
            if (a[i] == 'B' && a[i + 1] == 'G')
            {
                char c = a[i];
                a[i] = a[i + 1];
                a[i + 1] = c;
                i=i+1;
            }
        }
    }

    for (int i = 0; i < n; i++)
    {
        cout << a[i];
    }
}
