#include <iostream>
using namespace std;
int main()
{
    int n;
    cin >> n;
    int m[n];
    for (int i = 0; i < n; i++)
    {
        cin >> m[i];
    }
    int count = 0; 
    for (int i = 0; i < n; i++)
    {
        if (m[i] != m[i + 1])
        {
            count++;
        }
    }
    cout << count << endl;
}
/*
n সংখ্যক ম্যাগনেটের ইনপুট দেওয়া হবে। প্রতিটা ম্যাগনেটের পজিশন হবে "01" বা "10" — মানে, প্লাস-মাইনাস অথবা মাইনাস-প্লাস।

এখন, পাশাপাশির দুইটা ম্যাগনেট যদি একি পজিশনে থাকে (মানে একি রকম — যেমন: দুটোই "10"), তাহলে তারা একই গ্রুপে থাকবে।
আর যদি পরপর দুটি ম্যাগনেটের পজিশন ভিন্ন হয় (যেমন: একটার "10", পরেরটা "01"), তাহলে একটা নতুন গ্রুপ শুরু হয়।

 এইভাবে ম্যাগনেটগুলোর মধ্যে কয়টা গ্রুপ হলো, সেটা বের করা।
 Input:
6
10
10
10
01
10
10

Output:
3

Explanation:
[10,10,10] → এক গ্রুপ  
[01] → আলাদা গ্রুপ  
[10,10] → আরেক গ্রুপ  
→ মোট ৩টা গ্রুপ।

Input:
4
01
01
10
10

Output:
2

Explanation:
[01,01] → এক গ্রুপ  
[10,10] → এক গ্রুপ  
→ মোট ২টা গ্রুপ।

Input Size:
1 ≤ n ≤ 100000, প্রতিটি ইনপুট সাইজ দুই অক্ষরের fixed string "10" বা "01"।

Time Complexity:
O(n) — কারণ আমরা প্রতিটা ম্যাগনেট একবার করেই দেখবো।
Space Complexity:
O(1) — শুধু আগের পজিশন মনে রাখলেই হয়।
*/