/*
n সংখ্যক রুমের তথ্য দেওয়া হবে। প্রতিটা রুমে বর্তমানে কয়জন থাকে (pi) এবং রুমের মোট ক্যাপাসিটি (qi) দেওয়া থাকবে। এখন George এবং তার বন্ধু Alex — এই দুইজন একসাথে থাকতে পারবে, এমন রুম গুনে বের করতে হবে। মানে এমন রুম খুঁজবো যেখানে আরও অন্তত ২ জন জায়গা খালি আছে।

Input:
প্রথম লাইনে থাকবে n (রুমের সংখ্যা)। এরপর n লাইনে প্রতি লাইনে থাকবে দুটি সংখ্যা pi আর qi — যারা আগে থেকেই রুমে আছে এবং রুমে মোট কতজন থাকতে পারে।

Output:
একটা সংখ্যা, কয়টা রুমে George আর Alex থাকতে পারবে।

উদাহরণ ইনপুট-আউটপুটসহ:
Input:
3
1 1
2 2
3 3
Output:
0

ব্যাখ্যা: কোনো রুমেই অতিরিক্ত ২ জন থাকার জায়গা নাই। তাই উত্তর ০।

Input:
3
1 10
0 10
10 10
Output:
2

ব্যাখ্যা: প্রথম দুইটা রুমে যথাক্রমে 9 জন ও 10 জন জায়গা ফাঁকা, তাই George আর Alex থাকতে পারবে। তাই উত্তর ২।
Input Size:
n ≤ 100 এবং প্রতিটি pi ও qi সর্বোচ্চ 100 পর্যন্ত।

Time Complexity:
O(n) — কারণ আমরা প্রতিটা রুম একবার করে দেখবো।
Space Complexity:
O(1) — কারণ অতিরিক্ত জায়গা প্র্যাকটিক্যালি নিচ্ছি না, শুধু একটা কাউন্টার রাখবো।
*/
#include <iostream>
using namespace std;
int main()
{
    int n;
    cin>>n;
    int a[n], b[n];
    int p = 0;

    for (int i = 0; i < n; i++)
    {
        cin >> a[i] >> b[i];
        int k = b[i] - a[i];
        if (k >=2)
        {
            p++;
        }
    }
    cout << p;
}