#include <iostream>
using namespace std;
int main()
{
    long long n;
    cin >> n;
    long long h;
    if (n % 2 == 0)
    {
        h = n / 2;
    }
    else
    {
        h = -((n + 1) / 2);
    }
    cout << h;
}
/*
প্রশ্নটি একটি ফাংশনের উপর ভিত্তি করে। f(n) নামের এই ফাংশন সংজ্ঞায়িত করা হয়েছে এমনভাবে যে, ১ থেকে n পর্যন্ত সব সংখ্যার মধ্যে বিজোড় সংখ্যাগুলো ঋণাত্মক আর জোড় সংখ্যাগুলো ধনাত্মক হিসেবে যোগ করা হয়। অর্থাৎ, যদি n = 5 হয়, তাহলে f(5) = -1 + 2 - 3 + 4 - 5 = -3। একইভাবে যদি n = 4 হয়, তাহলে f(4) = -1 + 2 - 3 + 4 = 2।

এই প্রশ্নে তোমাকে একটি ধনাত্মক পূর্ণসংখ্যা n দেওয়া হবে, যেখানে 1 ≤ n ≤ 10^15, এবং তোমাকে f(n) এর মান বের করতে হবে।

উদাহরণ ইনপুট ও আউটপুট:

Input:
4
Output:
2

Input:
5
Output:
-3

এখন যেহেতু n এর মান বিশাল (১০^১৫ পর্যন্ত), তাই O(n) টাইম কমপ্লেক্সিটির সমাধান দেওয়া যাবে না। আমাদের O(1) সময়ে কাজ করতে হবে। লক্ষ্য করলে দেখা যাবে, প্রতিটি জোড় সংখ্যার মান ধনাত্মক এবং প্রতিটি বিজোড় সংখ্যার মান ঋণাত্মক।

তাই, আমরা যদি n জোড় হয়, তাহলে f(n) = n / 2
আর যদি n বিজোড় হয়, তাহলে f(n) = -((n + 1) / 2)

টাইম কমপ্লেক্সিটি: O(1)
স্পেস কমপ্লেক্সিটি: O(1)
কারণ শুধুমাত্র একটা if-else চেক করেই ফলাফল বের করে ফেলা যায়।

*/